#### PlasticvinylType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "PlasticvinylType" from the "PlasticVinyl" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum PlasticvinylType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PlasticvinylType ``` |

| Visual C++ |
| --- |
| ``` public enum class PlasticvinylType ``` |

# Members

| Member name | Description |
| --- | --- |
| Plasticsolid |  |
| Plastictransparent |  |
| Vinyl |  |

# See Also

Autodesk.Revit.DB.Visual Namespace